app/views/pages/feed.html.erb


  <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]

    <%= comment.content %>
    <% if comment.likes.select { |like| like.user == current_user }.any? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]