app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    <%= comment.content %>
    <% if comment.likes.select { |like| like.user == current_user }.any? %>