app/controllers/comments_controller.rb

  def create
    post = Post.find_by(id: params[:post_id])
    comment = post.comments.new(comment_params)
    comment.user_id = current_user.id
    if comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 3], ["content", "comment1"], ["user_id", 5], ["created_at", "2020-02-07 17:06:29.281685"], ["updated_at", "2020-02-07 17:06:29.281685"]]