app/controllers/friendships_controller.rb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."confirmed" = $2 AND "friendships"."friend_id" = $3  [["friend_id", 5], ["confirmed", true], ["friend_id", 5]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."user_id" = $2  [["user_id", 5], ["user_id", 5]]
---
  def index
    @direct_friends = current_user.friendships.where(confirmed: true, user_id: current_user.id)
    @inverse_friends = current_user.inverse_friendships.where(confirmed: true, friend_id: current_user.id)
    @sent = current_user.friendships.where(user_id: current_user.id, confirmed: nil)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["friend_id", 1], ["created_at", "2020-02-07 22:33:08.425959"], ["updated_at", "2020-02-07 22:33:08.425959"]]
---
  def create
    @friend = User.find_by(id: params[:user_id])
    friendship = current_user.friendships.new(friend: @friend)
    friendship.valid?
    if @friend.id != current_user.id && friendship.save

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "friendships" SET "confirmed" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["confirmed", true], ["updated_at", "2020-02-07 22:41:37.942040"], ["id", 28]]
---
  def update
    @friendship = Friendship.find_by(id: params[:id])
    @friendship.update(confirmed: true)

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 13]]
---
  def destroy
    @friendship = Friendship.find_by(id: params[:id])
    user = @friendship.user
    friend = @friendship.friend
    @friendship2 = Friendship.find_by(user_id: friend, friend_id: user)
    @friendship.destroy