app/controllers/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Comment"], ["likeable_id", 4], ["created_at", "2020-02-07 17:06:33.547574"], ["updated_at", "2020-02-07 17:06:33.547574"], ["user_id", 5]]
---
  def create
    like = Like.new
    if params[:post_id]
      post = Post.find_by(id: params[:post_id])
      like.likeable = post
    elsif params[:comment_id]
      comment = Comment.find_by(id: params[:comment_id])
      like.likeable = comment
    end
    like.user_id = current_user.id
    like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    like = Like.find_by(id: params[:id])
    like.destroy