app/controllers/pages_controller.rb

  def feed
    @friendships = current_user.friendships.select { |friendship| friendship.friend.id if friendship.confirmed } +
                   current_user.inverse_friendships.select { |friendship| friendship.user.id if friendship.confirmed }
    @posts = Post.where('user_id IN (:ids)', ids: @friendships + [current_user.id]).order(created_at: :desc)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 6]]
SELECT "posts".* FROM "posts" WHERE (user_id IN (6,5)) ORDER BY "posts"."created_at" DESC