app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "aaaa"], ["user_id", 5], ["image", ""], ["created_at", "2020-02-06 21:04:08.318585"], ["updated_at", "2020-02-06 21:04:08.318585"]]
---
  def create
    post = current_user.posts.new(post_params)
    if post.save