app/controllers/users_controller.rb

  def index
    friendships = current_user
      .friendships.where(user_id: current_user.id).map(&:friend) + current_user
      .inverse_friendships.where(friend_id: current_user.id).map(&:user) + [current_user]
    @users = User.all - friendships
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def show
    @user = User.find_by(id: params[:id])
    @friendship = Friendship.find_by(user_id: @user.id) || Friendship.find_by(friend_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."friend_id" = $2  [["friend_id", 5], ["friend_id", 5]]