app/views/layouts/_navbar.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 6]]
---
      <li class="nav-item px-3 text-nowrap">
       <%= link_to "> friend requests ( #{current_user.inverse_friendships.select{ |friendship| friendship.confirmed.nil? }.count if current_user} )", friends_path, class: "d-inline nav-link text-white" %>